Repository: django-cms/djangocms-bootstrap4
Catalog: djangocms_bootstrap4/locale/*/LC_MESSAGES/django.po
Languages: et

source: Extra small
et: Eriti väike

source: Small
et: Väike

source: Medium
et: Keskmine

source: Large
et: Suur

source: Extra large
et: Eriti suur

source: Primary
et: Esmane

source: Secondary
et: Teisene

source: Success
et: Edukas

source: Danger
et: Oht

source: Warning
et: Hoiatus

source: Light
et: Hele

source: Dark
et: Tume

source: Left
et: Vasakpoolne

source: Center
et: Keskmine

source: Right
et: Parempoolne

source: Alert
et: Teade

source: Advanced settings
et: Täpsemad seaded

source: Context
et: Kontekst

source: Dismissable
et: Eiratav

source: Allows the alert to be closed.
et: Laseb kasutajal teate sulgeda.

source: Close
et: Sulge

source: Badge
et: Märk

source: Badge text
et: Märgi tekst

source: Pills style
et: Pilli stiil

source: Activates the pills style.
et: Aktiveerib pilli stiili.

source: Card
et: Kaart

source: Card inner
et: Kaardi sisu

source: Card group
et: Kaardi grupp

source: Card deck
et: Kaardipakk

source: Card columns
et: Kaartide tulbad

source: Body
et: Sisu

source: Header
et: Päis

source: Footer
et: Jalus

source: Transparent
et: Läbipaistev

source: White
et: Valge

source: Card type
et: Kaardi tüüp

source: Background context
et: Tausta kontekst

source: Alignment
et: Joondus

source: Outline
et: Ääris (outline)

source: Uses the border context instead of the background.
et: Kasutab tausta konteksti asemel äärise oma.

source: Text context
et: Teksti kontekst

source: Inner type
et: Sisemine tüüp

source: Define the structure of the plugin.
et: Defineeri vidina struktuur.

source: Carousel
et: Pildikarussell

source: Carousel slide
et: Pildikarusselli slaid

source: Link settings
et: Lingi seaded

source: Default
et: Vaikimisi

source: Template
et: Mall

source: This is the template that will be used for the component.
et: Seda malli kasutatakse komponendi jaoks.

source: Interval
et: Intervall

source: The amount of time to delay between automatically cycling an item. If false, carousel will not automatically cycle.
et: Selle väärtuse suurune on intervall automaatsel slaidi vahetumisel. Kui on sätestamata, siis slaidid automaatselt ei vahetu.

source: Controls
et: Külgnupud

source: Adding in the previous and next controls.
et: Eelmise ja järgmise slaidi nuppude lisamine.

source: Indicators
et: Indikaatorid

source: Adding in the indicators to the carousel.
et: Pildikarusselli asukoha indikaatorite lisamine.

source: Keyboard
et: Klaviatuur

source: Whether the carousel should react to keyboard events.
et: Kas pildikarussell reageerib klaviatuurile.

source: Pause
et: Paus

source: If set to "hover", pauses the cycling of the carousel on "mouseenter" and resumes the cycling of the carousel on "mouseleave". If set to "false", hovering over the carousel won't pause it.
et: Kui on seatud "hoveri" peale, siis läheb pildikarussell hiire slaidile sisenemisel (mouseenter) pausile ja jätkub, kui hiir lahkub. Kui on seatud "false", siis hiirega slaidile liikumine pildikarusselli ei peata.

source: Ride
et: Vahetumine

source: Autoplays the carousel after the user manually cycles the first item. If "carousel", autoplays the carousel on load.
et: Vahetab slaide automaatselt, kui kasutaja on esimese slaidi käsitsi edasi liigutanud. Kui on seatud "carouseli" peale, siis vahetab slaide kohe automaatselt.

source: Wrap
et: Mähi

source: Whether the carousel should cycle continuously or have hard stops.
et: Kas pildikarussell peaks jätkuvalt liikuma või vahepeal peatuma.

source: Aspect ratio
et: Pildisuhe

source: Determines width and height of the image according to the selected ratio.
et: Määrab vastavalt valitud väärtusele pildi laiuse ja kõrguse suhte.

source: Slide image
et: Slaidi pilt

source: Content
et: Sisu

source: Content may also be added using child plugins.
et: Sisu saab lisada ka alamvidinatega.

source: Previous
et: Eelmine

source: Next
et: Järgmine

source: Collapse
et: Kokku volditav

source: Collapse trigger
et: Kokkuvoltimise nupp

source: Collapse container
et: Kokkuvoltimise konteiner

source: Siblings
et: Sama taseme elemendid

source: Element to be used to create accordions.
et: Element, millega akordioni luua.

source: Unique identifier
et: Unikaalne nimetaja

source: Identifier to connect trigger with container.
et: Nimetaja, millega nupp konteineriga seotakse.

source: There is no configuration required here.
et: Seda pole vaja seadistada.

source: Code
et: Koodijupp

source: Blockquote
et: Plokktsitaat

source: Figure
et: Joonis

source: Inline code
et: Koodijupp teksti sees

source: Code block
et: Koodi plokk

source: Variables
et: Muutujad

source: User input
et: Kasutaja sisend

source: Sample output
et: Näidisväljund

source: Code type
et: Koodi tüüp

source: Quote
et: Tsitaat

source: Cite
et: Allikas

source: Caption
et: Pildiallkiri

source: Container
et: Konteiner

source: Row
et: Rida

source: Column
et: Tulp

source: Responsive settings
et: Ekraanisuuruse kohandumise seaded

source: Fluid container
et: Fluiidne konteiner

source: Align items start
et: Reasta elemendid algusesse

source: Align items center
et: Reasta elemendid keskele

source: Align items end
et: Reasta elemendid lõppu

source: Justify content start
et: Joonda elemendid algusesse

source: Justify content center
et: Joonda elemendid keskele

source: Justify content end
et: Joonda elemendid lõppu

source: Justify content around
et: Joonda elemendid ühtlaste ümbrustega

source: Justify content between
et: Joonda elemendid ühtlaste vahedega

source: Align self start
et: Reasta element algusesse

source: Align self center
et: Reasta element keskele

source: Align self end
et: Reasta element lõppu

source: Break
et: Täislaius

source: Empty
et: Tühi

source: Create columns
et: Loo tulbad

source: Number of columns to create when saving.
et: Mitu tulpa salvestamisel luua.

source: Container type
et: Konteineri tüüp

source: Defines if the grid should use fixed width (<code>.container</code>) or fluid width (<code>.container-fluid</code>).
et: Määrab, kas grid peaks kasutama ettemääratud laiust (<code>.container</code>) või fluiidset laiust (<code>.container-fluid</code>).

source: Vertical alignment
et: Vertikaaljoondus

source: Read more in the <a href="{link}" target="_blank">documentation</a>.
et: Loe lähemalt <a href="{link}" target="_blank">dokumentatsioonist</a> (inglise keeles).

source: Horizontal alignment
et: Horisontaaljoondus

source: Remove gutters
et: Eemalda tulpade tühi ruum külgedelt

source: Removes the marginal gutters from the grid.
et: Eemaldab tulpi ümbritseva tühja ruumi.

source: (1 column)
et: (1 tulp)

source: Column type
et: Tulba tüüp

source: Column size
et: Tulba laius

source: Nummeric value from 1 - {bound}. Spreads the columns evenly when empty.
et: Numbriline väärtus 1-{bound}. Väärtuse tühjaksjätmisel jaotatakse ruum tulpade vahel võrdselt.

source: Order
et: Järjekord

source: Margin left
et: Vasakpoolne serv

source: Margin right
et: Parempoolne serv

source: Reset
et: Lähtesta

source: Fluid
et: Fluiidne

source: Adds the .jumbotron-fluid class.
et: Lisab .jumbotron-fluid klassi

source: Link / Button
et: Link / nupp

source: Button
et: Nupp

source: Type
et: Tüüp

source: Adds either the .btn-* or .text-* classes.
et: Lisab kas .btn-* või .text-* klassi.

source: Size
et: Suurus

source: Applies the .btn-outline class to the elements.
et: Lisab elementidele .btn-outline klassi.

source: Block
et: Täislaiuses

source: Extends the button to the width of its container.
et: Laiendab nupu konteineri laiuseks.

source: Icon left
et: Vasakpoolne ikoon

source: Icon right
et: Parempoolne ikoon

source: Preview
et: Eelvaade

source: List group
et: Listi kogum

source: List item
et: Listi element

source: Active
et: Aktiivne

source: Disabled
et: Mitteaktiivne

source: List group flush
et: Listi kogum flush

source: Create lists of content in a card with a flush list group.
et: Loob kaardi sisusse flush tüüpi listi kogumi.

source: State
et: Olek

source: Media
et: Meedia

source: Media body
et: Meedia sisu

source: Picture / Image
et: Pilt

source: Responsive
et: Kohanduv

source: Adds the .img-fluid class to make the image responsive.
et: Lisab pildile .img-fluid klassi, et pild kohanduks ekraanile.

source: Rounded
et: Ümardatud

source: Adds the .rounded class for round corners.
et: Lisab .rounded klassi, et pildi nurgad oleks ümarad.

source: Thumbnail
et: Pisipilt

source: Adds the .img-thumbnail class.
et: Lisab .img-thumbnail klassi.

source: Tabs
et: Vahelehe nupud

source: Tab item
et: Vahelehe nupp

source: Pills
et: Pillid

source: Fill
et: Täida

source: Justified
et: Joondatud

source: Justify start
et: Joonda algusesse

source: Justify center
et: Joonda keskele

source: Justify end
et: Joonda lõppu

source: Fade
et: Hajuta

source: Index
et: Indeks

source: Index of element to open on page load starting at 1.
et: Selle elemendi indeks, mis lehe laadimisel laadida, alustades numbrist 1.

source: Animation effect
et: Animatsiooni efekt.

source: Tab title
et: Vahelehe pealkiri

source: Spacing
et: Ruum

source: Property
et: Omadus

source: Sides
et: Ääred

source: Device
et: Seade

source: Attributes
et: Atribuudid

source: Tag type
et: Elemendi tüüp

source: Select the HTML tag to be used.
et: Vali HTML element, mida kasutada.
